{
  "nav__link__1": "БІЗ ТУРАЛЫ",
  "nav__link__2": "ТҰРАР ТҰРАМЫ",
  "nav__link__3": "МАҚСАТ",
  "nav__link__4": "OPENTURKISTANTV",
  "nav__link__5": "БАЙЛАНЫС",

  "header__subtitle": "Түркістан қаласы, Қазақстандық оңтүстікта, Сырдария өзеніне жақын. 2018 жылдың 19 маусымынан бастап Түркістан облысының (ала тармақта — Оңтүстік Қазақстан) административті орталығы болды. Қазақстандың ең ескі қалаларының бірі. Шымкенттен солтүстік-батысында 160 км-ге орналасқан, Қызылорда мен Тошкент арасындағы Тошкент әуесінде. Қала — мұсылмандардың паломничесі үшін бір орта.",
  "destination__title__1": "Түркістан",
  "destination__title__2": "Дестинациялар",
  "destination__subtitle": "Қаланың тарихи дайындалулары мен ескертулерімен толтырылған, бірақ онда мейірімді бутіктер, стильді ресторандар мен дизайнердік дүкендердің көпі бар. Қала жаңа салушыларды бөгетті, жаңбарлық пенігі бар аймағанын сезеді.",
  "destination__slide__1": "Хожа Ахмет Яссауи мавзолеясы",
  "destination__slide__2": "Жайлау",

  "hotel__price": "12 000 ₸ бастап",

  "impression__title__1": "Түркістаннан",
  "impression__title__2": "алған әсерім",
  "impression__subtitle": "Бұл трансконтиненталды мегаполис жылдықты тыс жетіп артатын күльтүр, ас өйткенділіктік той, әдебиет және өтеушілік саласының күйдін көрсетеді, ал оларды тарататын Босфортың салтанатты көпісін өмірсіздікке салмайтын пайдаланылмайды.",
  "impression__slide__1": "Толық көмек отелі",
  "impression__slide__2": "Gastro Turkistan",
  "impression__slide__3": "Тарихи-білімдік",
  "impression__slide__4": "Денсаулық туризмі",
  "impression__slide__5": "Экологиялық туризм",

  "feedback__title__1": "Түркістанға",
  "feedback__title__2": "бару",
  "feedback__subtitle": "Дамыту үшін кешірім сұрау жасаңыз! Сізді меңгерген менеджерлеріміз көмек көрсету, шарттар мен мүмкіндіктер туралы ақпарат береді.",
  "feedback__input__1": "Сіздің атыңыз",
  "feedback__input__2": "Телефон нөмірі",
  "feedback__action": "Жіберу",

  "footer__rights": "Авторлық құқық © 2023 Түркістан. Барлық құқықтар қорғалған TGA",
  "footer__politics__1": "Кукілік саясаты",
  "footer__politics__2": "Жеке деректер саясаты",

  "destination__title": "Түркістанның бағыттары",
  "destination__body": "Қала тарихи асыл тастар мен мәдени ескерткіштерге толы, сонымен қатар сәнді бутиктердің, жайлы мейрамханалардың және эксклюзивті дизайнерлік дүкендердің көптігімен таң қалдырады. Көше бойында соңғы трендтермен үйлесетін және стиль мен талғампаздық сезімін беретін сән-салтанат атмосферасы бар. Қала сергектік пен талғампаздықты құптайды, оған келгендердің барлығына бірегей тәжірибе жасайды.",
  "destination__names": "Атаулар Орындар"
}
