<template>
  <MenuComponent />
  <div class="destination-item">
    <div class="destination-item__back">
      <div class="_container">
        <div class="destination-item__wrap">
          <div class="destination-item__uptitle">Дестинации</div>
          <div class="destination-item__title">{{destination.title}}</div>
          <div class="destination-item__subtitle">{{destination.subtitle}}</div>
        </div>
      </div>
    </div>
    <div class="destination-item__text">
      <div class="_container">
        <div class="destination-item__item">
          <div class="destination-item__item__text">{{destination.text1}}</div>
          <div class="destination-item__item__img"><img :src="destination.img1" alt=""></div>
        </div>
        <div class="destination-item__item">
          <div class="destination-item__item__img"><img :src="destination.img2" alt=""></div>
          <div class="destination-item__item__text">{{destination.text2}}</div>
        </div>
      </div>
    </div>
  </div>
  <div class="section__impression">
    <div class="section__impression__content">
      <div class="section__row _container">
        <div class="section__impression__item">
          <div class="section__title mb-10">
            Дестинации
          </div>
        </div>
      </div>
      <ImpressionSlider />
    </div>
  </div>
  <div class="section__impression">
    <div class="section__impression__content">
      <div class="section__row _container">
        <div class="section__impression__item">
          <div class="section__title mb-10">
            Впечатления
          </div>
        </div>
      </div>
      <ImpressionSlider />
    </div>
  </div>
  <FooterComponent />
</template>

<script setup>
import FooterComponent from '@/components/FooterComponent.vue';
import MenuComponent from '@/components/MenuComponent.vue';
import ImpressionSlider from "@/components/sliders/ImpressionSlider.vue";
import { computed, ref } from 'vue';
import { useRoute } from 'vue-router';

const route = useRoute();
const pageId = route.params.id;

const data = ref([
  {
    title: 'Сайрам-Угам',
    subtitle: 'Государственный национальный природный парк',
    text1: 'Сайрам-Угамский природный парк расположен в северо – восточной части западного Тянь-Шаня и представлен горными массивами: Угамским, Каржантау, Казыгурт и Боралдайтау. Парк был создан постановлением Правительства РК в 2006 году. Общая площадь парка составляет около 150000 га. Территория парка имеет 7 природных зон, начиная горной степной до высокогорной, где встречается 1635 видов растений, 59 видов млекопитающих и 300 видов птиц. Так же в регионе обитают животные и растения, занесенные в красную книгу Казахстана, такие как сурок Мензбира, беркут, Тянь-Шаньский белокоготный медведь, горный козел, снежный барс. На территории протекают реки Угам, Сайрамсу, Каскасу, Бургулюк, Бадам, Машат и Кокбулак.',
    img1: new URL(`@/assets/destination/p1.jpg`, import.meta.url).href,
    text2: 'Удивительные природные комплексы прекрасно сочетается с историческими памятниками средневековой культуры. На территории парка можно увидеть культовые сооружения, петроглифы, древние поселения и погребения различных исторических эпох.Сайрам-Угамский природный парк – это край разнообразных ландшафтов. Сочетание прекрасных природных комплексов и исторических достопримечательностей на Великом Шелковом Пути. А еще, Угамский регион, известен радушием и  гостеприимством местных жителей.',
    img2: new URL(`@/assets/destination/p1-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Аксу - Джабаглы',
    subtitle: 'Государственный природный заповедник',
    text1: 'Первый и старейший заповедник Средней Азии и Казахстана Заповедник «Аксу-Джабаглы» был организован в 1926 г. на 30 тыс. га; в 1948 г. его территория увеличилась до 73 тыс. га. Заповедник занимает большую часть северо-западной оконечности Таласского Алатау и смежный с ним участок Угамского хребта. В административном отношении заповедник находится на границе с Кыргызстаном и Узбекистаном, занимая земли Тюлькубасского, Толебийского, Байдыбекского районов Туркестанской области и Жуалинского района Жамбылской области. Высочайшая вершина заповедника – пик «Сайрам», высотой 4238 м над уровнем моря, в народе его называют «Актюеольген», т.к. очертаниями он напоминает бездыханно лежащего верблюда. В центральной части заповедника выделяется мощный ледниковый хребет Бугулутор, высотой 3926 м н.у. м .',
    img1: new URL(`@/assets/destination/p2.jpg`, import.meta.url).href,
    text2: 'Основные реки заповедника – Аксу и Жабагылы, в честь их и был назван заповедник, протекая в западном направлении, они впадают в реку Арысь. Самая крупная река заповедника – Аксу, протяженностью 120 км. Удивительные животные и растения населяют эти горы. По последним данным в заповеднике встречаются 267 видов птиц, 52 вида  млекопитающих, 11 видов пресмыкающихся, и 3 вида земноводных. Флора заповедника состоит из 1737 видов растений. Аксу-Джабаглы примечателен множеством живописных ландшафтов и уникальных природных объектов. Это изумительной красоты высокогорные озера Кокуйрум и Жасыл, сверкающие ледопады Джабаглы, Шунгульдука и Бугулытора, узкие скальные ворота Дарбаза в долине р. Балдабрек, величественная долина р. Майдантал. Загадочные массивы серых скал в Коралловом ущелье почти сплошь состоят из окаменевших останков древнейших животных (кораллов, губок, моллюсков) - обитателей огромного моря, покрывавшего эту территорию более 250 миллионов лет назад в палеозойскую эру.',
    img2: new URL(`@/assets/destination/p2-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Каратау',
    subtitle: 'Государственный природный заповедник',
    text1: 'Каратауский заповедник – самый молодой в Казахстане. Начиная с 1975 года, работавшие здесь биологи стали ставить вопрос о необходимости создания природоохранной территории. В 1980 эту инициативу поддержала академия наук Казахстана. И, наконец, в 2004 году появился новый заповедник. Основная цель организации заповедника заключается в изучении и сохранении популяции каратауского архара. На момент образования заповедника на горных склонах обитало всего 38 каратауских архаров, а сегодня количество этих животных превышает 300 особей.Расположен заповедник в Центральной части хребта Каратау, который является ответвлением северо–западных дуг Тянь–Шаня на территории Туркестанской области. Протяженность территории заповедника в меридиональном направлении составляет 28,3 км, в широтном направлении - 23,6 км. Общая площадь заповедника составляет 34300 га. Площадь охранной зоны составляет 17490 га.',
    img1: new URL(`@/assets/destination/p3.jpg`, import.meta.url).href,
    text2: 'Склоны хребта расчленены глубокими долинами многочисленных рек и временными водотоками, имеющими почти всюду сезонный поверхностный сток. Сравнительно крупные реки – Байылдыр, Биресик, Хантаги, Талдыбулак. Ни одна из них не доносит свои воды до главной водной артерии реки Сырдарья, теряя сток у подножия склонов. По обилию эндемичных и редких видов растений Каратау занимает первое место в Республике.Кроме каратауского архара, на территории заповедника встречаются еще 2 вида млекопитающих, которые занесены в Красную Книгу РК: индийский дикобраз и каменная куница. Из  118 видов птиц, обитающих в заповеднике, 12 занесены в Красную книгу Казахстана. Среди них белый и черный аисты, орел-карлик, степной орел, беркут, стервятник, филин и другие.',
    img2: new URL(`@/assets/destination/p3-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Кос Ана (Зерип Сланды)',
    subtitle: 'Архитектурно-мемориальный комплекс',
    text1: 'В горах Байдыбекского района, примерно в 120 км к северу от Шымкента, находится современный мавзолей на интересном средневековом, природном месте: Мавзолей Кос Ана. Согласно народным преданиям, здесь были погребены дочь Байдибека и его зять - Зерип-Сланды. Байдибек Карашаулы — легендарный персонаж, который считается казахским бием, активно участвовавшим в объединении казахского народа. Согласно последним данным он родился в 1356 г. в Ташкенте и умер в 1419 г. Мавзолей представляет собой современное белое здание, в котором расположены 18 стел с именами каждого из детей Байдибек Би. ',
    img1: new URL(`@/assets/destination/p4.jpg`, import.meta.url).href,
    text2: 'В стенах мавзолея видны руины мечети XII-XIII веков. Функция этого здания не ясна, оно могло быть частью небольшой мусульманской крепости  или монастыря сообщества суфийских дервишей. Известно только, что это здание было изготовлено из дорогого и высококачественного кирпича. В 50 м от мавзолея протекает источник с водой, известный своими очищающими свойствами. Это место так же очень интересно природой: Мавзолей Кос Ана находится в Национальном парке Каратау, пейзаж очень красив своими горами и рекой!',
    img2: new URL(`@/assets/destination/p4-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Кеме Калган',
    subtitle: 'Монумент',
    text1: 'Недалеко от гор Казыгурта, на высоте 910 метров над уровнем моря, находится памятник “Ноев ковчег”. Необычный памятник был установлен в 207 километрах от города Туркестан. Согласно местной легенде, две тысячи лет назад пророк Нух (Ной) приземлился на горе Казыгурт и люди стали называть это место «Кеме-Калган». Удивительно, но размер местного ковчега, созданного современными художниками из дерева и металла, такой же, как в описании в одном из святых источников . Длина ковчега  - 150 метров, ширина - 25 метров, а высота - 15 метров. Это место овеяно десятками легенд, которые краеведы готовы поведать всем туристам.',
    img1: new URL(`@/assets/destination/p5.jpg`, import.meta.url).href,
    text2: 'Несмотря на свою незначительную высоту сейчас, 2000 лет назад Казыгурт был выше всех гор Вселенной. Во время всемирного потопа, когда весь мир скрылся под водой, вершина Казыгурта осталась не затопленной. К ней и причалил Ноев ковчег. Это только одна из самых распространенных легенд. Гора Казыгурт имеет сакраментальное значение для народов Центральной Азии, в некоторых источниках ее называют Туркестанским  Араратом.',
    img2: new URL(`@/assets/destination/p5-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Жылаган Ата',
    subtitle: 'Пещера',
    text1: 'Пещера «Жылаган Ата» расположена у подножия горы Каратау, недалеко от г. Кентау в Туркестанской области.Пещера представляет собой большой грот, из которого течет родник. Причем вода из него бьет, когда человек с чистой душой и благими намерениями читает Коран.В эти края очень часто приезжают паломники. Иногда вода бежит сразу, как только люди начинают читать молитву. А порой ее приходится ждать неделями. В пещере Жылаган-ата часто остаются ночевать семейные пары, которые хотят завести ребенка.',
    img1: new URL(`@/assets/destination/p6.jpg`, import.meta.url).href,
    text2: 'Легенда гласит: жили здесь пожилые супруги. Они никогда не имели детей. И обратились к Всевышнему с просьбой послать ребенка, чтобы утешил их в старости. Услышав молитву, Аллах поставил супругам условие: семь лет носить матери своего долгожданного ребенка в кожаном мешке, пока он не встанет на ноги. Долго носила пожилая женщина нелегкую ношу. Но, однажды не выдержав, взмолилась, что не по силам ей такое испытание и в этот момент не рожденный младенец выпорхнул из кожаного мешка. Он удалился в расщелины скал и исчез в пещере на вершине горы. Отец, убитый горем, рыдал горько и безутешно. На том месте возник водопад из его слез. По дороге к пещере на вершине горы расположен колодец. На камнях вокруг пещеры отпечатались следы огромного человека. С правой стороны пещеры построен мавзолей. Вход в пещеру находится на высоте 15 метров над маленькой рекой. И река тоже называется «Жылаган ата».',
    img2: new URL(`@/assets/destination/p6-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Городской музей г. Кентау',
    subtitle: '',
    text1: 'История города Кентау неразрывно связана с историей освоения месторождений полезных ископаемых хребта Каратау: Ачисай, Байылдыр, Хантаги, Миргалимсай.',
    img1: new URL(`@/assets/destination/p7.jpg`, import.meta.url).href,
    text2: 'Кентауский городской музей был открыт в 1977 году. Он был создан по многочисленным просьбам жителей города. Они же и были активными участниками в формировании его фондов. Каждый музейный экспонат - это история города, его доблесть, его слава, рассказ о созидательных буднях. Сегодня в фондах музея хранятся около 8 тысяч экспонатов. В четырех залах выставлены более 1000 экспонатов, показана богатейшая коллекция полезных ископаемых. Посетителями являются школьники, студенты, ветераны, жители и гости города.',
    img2: new URL(`@/assets/destination/p7-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Шаммат ишан',
    subtitle: 'Мечеть музей',
    text1: 'Мечеть - медресе «Шаммат Ишан», в селе Карнак, была построена в 1896 году местными мастерами с целью повышения знаний жителей села. Фундамент мечети-медресе был заложен в 1789 году. Основатель — Шаммат-Ишан. По словам народа, Шаммат-Ишан был очень умным, интеллигентным человеком. С детства он получал религиозные знания у своего отца. Его жизненный путь — это пример борьбы с невежеством. В 2005 году на  базе мечети-медресе был открыт музей. Через четыре года здесь сделали капитальный ремонт. Сегодня общая площадь музея составляет 320 кв. метров. Он состоит из 29 комнат. Экспонаты средневековья рассказывают о быте наших предков. Есть такие рукописи, которые до сих пор не прочитаны.',
    img1: new URL(`@/assets/destination/p8.jpg`, import.meta.url).href,
    text2: 'Сейчас в фонде музея насчитывается более 1,5 тысяч экспонатов. Большая часть ценностей - это сохранившиеся  до сегодняшнего дня предметы средневековья: упряжь для лошадей, многообразие оружия, керамические и медные вазы, свечи, ювелирные изделия из серебра, различные монеты и т.п.',
    img2: new URL(`@/assets/destination/p8-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Укаш Ата',
    subtitle: 'Мавзолей',
    text1: 'Мавзолей Укаш – Ата расположен на склонах Каратау в 55 км к северо – востоку от г. Tуркестан. Общая длина мавзолея – 16 м, высота мавзолея 4 метра, ширина 4,6 метров. Легенда гласит о том, что Укаш-Ата был учеником Пророка Мухаммеда, несшим исламскую религию в эти края. Этот человек был храбрым воином, не знавшим ни одного поражения в битвах. Его многочисленные враги подкупили каким–то образом жену этого богатыря, и она, в конце концов смогла выведать у своего супруга, когда же он бывает наиболее уязвим. “Во время утренней молитвы Всевышнему, я полностью ухожу в себя…”- ответил ей Укаш-Ата. Вскоре отважный воин погиб. Во время очередной утренней молитвы враги, тихонько подкравшись сзади, отрубили ему голову его же собственным мечом, лежавшим рядом с молившимся. Голова батыра, как уверяют, покатилась прямо через близлежащий холм и упала в колодец, откуда моментально попала в Мекку к Пророку Мухаммеду, который таким образом и узнал о гибели лучшего из своих учеников. Внутри мавзолея, размещен глиняный саркофаг длиною 21 метр, ровно на столько утекла кровь из обезглавленного тела и ее накрыли этим саркофагом полностью, чтобы никто не смог наступить на нее.',
    img1: new URL(`@/assets/destination/p9.jpg`, import.meta.url).href,
    text2: 'На территории мавзолея Укаш-ата расположен колодец Гайып - Берген. По легенде, вода в колодце появилась в момент гибели прославленного воина Укаш-ата. Источник обладает особыми целебными качествами, однако набрать воды из него удается далеко не всем желающим. Из-за извилистости и крутизны расщелины — а колодец — это своеобразный разлом в горной породе, на дне которого бежит ручей, — черпать воду достаточно сложно. Ведро бьется о выступы стен, вода расплескивается и, как следствие, даже самое прочное ведро выдерживает не более двух-трех подъемов. По этой причине около колодца скопились целые горы разбитых ведер. Однако если посетителям все же удается испить воды из колодца — это считается особым знаком расположения со стороны высших сил.',
    img2: new URL(`@/assets/destination/p9-1.jpg`, import.meta.url).href,
  },
  {
    title: 'Ак Мечеть',
    subtitle: 'Подземная пещера',
    text1: 'Пещера Акмечеть – это чудо природы, которое возникло миллионы лет назад под влиянием тектонического явления. На юго-восточном склоне Каратау находится скалистая пещера, расположенная в 5 км от села Кенестобе Байдибекского района. Длина 150-160 м, ширина 60-65 м, высота 25-30 м. Купол пещеры напоминает шанырак юрты. На двадцатиметровой глубине подземного зала пещеры растут старые шелковицы. Под одной из них, в пещере прятались женщины и дети во время джунгарского нашествия. Другая легенда гласит о том, что в стародавние времена здесь была пещера дракона, который нападал на людей и скот. Когда дракон расправлял крылья, то задевал края разлома и постепенно увеличивал его. Но однажды пришел в эти края пророк Сулейман и посадил чудовище на цепь. О том, сколько лет после этого прожил дракон, легенда умалчивает, зато место, где он спал, осталось.',
    img1: new URL(`@/assets/destination/p10.jpg`, import.meta.url).href,
    text2: 'Уникальным является также то, что наверху нет ни одного дерева в радиусе многих километров. А в пещере настоящий оазис.',
    img2: new URL(`@/assets/destination/p10-1.jpg`, import.meta.url).href,
  },
])

const destination = computed(() => {
  return data.value[pageId - 1]
});

console.log(destination);
</script>

<style lang="scss">
.destination-item {
  padding-top: 80px;

  &__back {
    background-image: url('@/assets/destination/back.gif');
    background-size: cover;
    background-repeat: no-repeat;
    height: calc(100vh - 80px);
    background-position: center;
    margin-bottom: 82px;
  }
  &__wrap {
    display: flex;
    flex-direction: column;
    justify-content: flex-end;
    height: calc(100vh - 80px);
    padding-bottom: 45px;
  }

  &__uptitle {
    color: white;
    font-family: Montserrat;
    font-size: 24px;
    font-weight: 500;
  }

  &__title {
    color: white;
    font-family: Montserrat;
    font-size: 48px;
    font-weight: 800;
  }

  &__subtitle {
    color: white;
    font-family: Montserrat;
    font-size: 16px;
    line-height: 24px;
    max-width: 425px;
  }

  &__item {
    display: flex;
    gap: 20px;
    margin-bottom: 71px;
    @media (max-width: 1252px) {
      flex-direction: column;
    }
    &__img {
      min-width: 586px;
      width: 100%;
      height: 400px;
      @media (max-width: 1252px) {
        min-width: 100%;
      }
      img {
        width: 100%;
        height: 100%;
        object-fit: cover;
        border-radius: 20px;
      }
    }
    &__text {
      color: var(--secondary-color);
      font-family: Montserrat;
      font-size: 16px;
      line-height: 24px;
    }
  }
  &__text {
    margin-bottom: 146px;
  }
}
</style>